Revit 2027 API
ExportPatternTable.GetValues Method
 Returns all the values stored in the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ExportPatternInfo> GetValues()
Public Function GetValues As IList(Of ExportPatternInfo)
public:
IList<ExportPatternInfo^>^ GetValues()
member GetValues : unit -> IList<ExportPatternInfo>
Return Value
IList<ExportPatternInfo>
 Return the info array.
See Also
Reference
ExportPatternTable Class
Autodesk.Revit.DB Namespace